{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Culture Knowledge Graphs Using MELODY and the public SPARQL Endpoint for NFDI4Culture"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas as pd\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"../files/queries.json\") as f:\n",
    "    queries = json.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries = queries[\"feasible_queries\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'count_composition_year': 'PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX schema: <http://schema.org/>\\n\\nSELECT ?year (COUNT(?composition) AS ?numberOfCompositions)\\nWHERE {\\n  ?composition rdf:type schema:MusicComposition .\\n  ?composition schema:dateCreated ?dateCreated .\\n  BIND(YEAR(xsd:dateTime(?dateCreated)) AS ?year)\\n}\\nGROUP BY ?year\\nORDER BY ?year',\n",
       " 'count_composition_decade': 'PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX schema: <http://schema.org/>\\n\\nSELECT ?decade (COUNT(?composition) AS ?numberOfCompositions)\\nWHERE {\\n  ?composition rdf:type schema:MusicComposition .\\n  ?composition schema:dateCreated ?dateCreated .\\n  BIND(FLOOR(YEAR(xsd:dateTime(?dateCreated))/10)*10 AS ?decade)\\n}\\nGROUP BY ?decade\\nORDER BY ?decade',\n",
       " 'distinct_years': 'PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX schema: <http://schema.org/>\\n\\nSELECT DISTINCT (YEAR(xsd:dateTime(?dateCreated)) AS ?year)\\nWHERE {\\n  ?composition rdf:type schema:MusicComposition .\\n  ?composition schema:dateCreated ?dateCreated .\\n}\\nORDER BY ?year',\n",
       " 'count_compositions_composers_decade': 'PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX schema: <http://schema.org/>\\n\\nSELECT ?decade (COUNT(?composition) AS ?numberOfCompositions) (COUNT(DISTINCT ?composer) AS ?numberOfComposers)\\nWHERE {\\n  ?composition rdf:type schema:MusicComposition .\\n  ?composition schema:dateCreated ?dateCreated .\\n  ?composition schema:composer ?composer .\\n  BIND(FLOOR(YEAR(xsd:dateTime(?dateCreated))/10)*10 AS ?decade)\\n}\\nGROUP BY ?decade\\nORDER BY ?decade',\n",
       " 'count_compositions_persons_decade': 'PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX schema: <http://schema.org/>\\nPREFIX nfdicore: <https://nfdi4culture.de/ontology#>\\n\\nSELECT ?decade (COUNT(?composition) AS ?numberOfCompositions) (COUNT(DISTINCT ?person) AS ?numberOfRelatedPersons)\\nWHERE {\\n  ?composition rdf:type schema:MusicComposition .\\n  ?composition schema:dateCreated ?dateCreated .\\n  ?composition nfdicore:relatedPerson ?person .\\n  BIND(FLOOR(YEAR(xsd:dateTime(?dateCreated))/10)*10 AS ?decade)\\n}\\nGROUP BY ?decade\\nORDER BY ?decade',\n",
       " 'count_compositions_composer_decade': 'PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX schema: <http://schema.org/>\\n\\nSELECT ?decade ?composer (COUNT(?composition) AS ?numberOfCompositions)\\nWHERE {\\n  ?composition rdf:type schema:MusicComposition .\\n  ?composition schema:dateCreated ?dateCreated .\\n  ?composition schema:composer ?composer .\\n  BIND(FLOOR(YEAR(xsd:dateTime(?dateCreated))/10)*10 AS ?decade)\\n}\\nGROUP BY ?decade ?composer\\nORDER BY ?decade DESC (?numberOfCompositions)',\n",
       " 'count_compositions_composer_name_decade': 'PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX schema: <http://schema.org/>\\n\\nSELECT ?decade ?composer ?composerName (COUNT(?composition) AS ?numberOfCompositions)\\nWHERE {\\n  ?composition rdf:type schema:MusicComposition .\\n  ?composition schema:dateCreated ?dateCreated .\\n  ?composition schema:composer ?composer .\\n  OPTIONAL { ?composer schema:name ?composerName . } # Attempt to get human-readable name\\n  OPTIONAL { ?composer rdfs:label ?composerName . }  # Fallback to rdfs:label if available\\n  BIND(FLOOR(YEAR(xsd:dateTime(?dateCreated))/10)*10 AS ?decade)\\n}\\nGROUP BY ?decade ?composer ?composerName\\nORDER BY ?decade DESC (?numberOfCompositions)'}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql = SPARQLWrapper(\"https://nfdi4culture.de/sparql\")\n",
    "sparql.setReturnFormat(JSON)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "QUERIES = {\n",
    "    \"n_triplets\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT (COUNT(*) AS ?tripleCount)\n",
    "        WHERE {\n",
    "            ?s ?p ?o .\n",
    "        }\n",
    "    \"\"\",\n",
    "\n",
    "    \"all_types\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?type\n",
    "        WHERE {\n",
    "            ?s rdf:type ?type .\n",
    "        }\n",
    "        ORDER BY ?type\n",
    "    \"\"\",\n",
    "\n",
    "    \"n_instances_per_type\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT ?type (COUNT(?s) AS ?instanceCount)\n",
    "        WHERE {\n",
    "            ?s rdf:type ?type .\n",
    "        }\n",
    "        GROUP BY ?type\n",
    "        ORDER BY DESC(?instanceCount)\n",
    "    \"\"\",\n",
    "\n",
    "    \"type_properties\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT ?type ?property (COUNT(?property) AS ?propertyCount)\n",
    "        WHERE {\n",
    "            ?s rdf:type ?type ;\n",
    "               ?property ?o .\n",
    "        }\n",
    "        GROUP BY ?type ?property\n",
    "        ORDER BY ?type DESC(?propertyCount)\n",
    "    \"\"\",\n",
    "\n",
    "    \"all_properties\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?property\n",
    "        WHERE {\n",
    "            ?s ?property ?o .\n",
    "        }\n",
    "        ORDER BY ?property\n",
    "    \"\"\",\n",
    "\n",
    "    \"n_instances_per_property\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT ?property (COUNT(?s) AS ?instanceCount)\n",
    "        WHERE {\n",
    "            ?s ?property ?o .\n",
    "        }\n",
    "        GROUP BY ?property\n",
    "        ORDER BY DESC(?instanceCount)\n",
    "    \"\"\",\n",
    "\n",
    "    \"property_values\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT ?property ?value (COUNT(?s) AS ?usageCount)\n",
    "        WHERE {\n",
    "            ?s ?property ?value .\n",
    "        }\n",
    "        GROUP BY ?property ?value\n",
    "        ORDER BY ?property DESC(?usageCount)\n",
    "    \"\"\",\n",
    "\n",
    "    \"subjects_with_property\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?subject\n",
    "        WHERE {\n",
    "            ?subject ?property ?o .\n",
    "            FILTER(?property = <PROPERTY_URI>)\n",
    "        }\n",
    "        ORDER BY ?subject\n",
    "    \"\"\",\n",
    "\n",
    "    \"objects_with_property\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?object\n",
    "        WHERE {\n",
    "            ?s ?property ?object .\n",
    "            FILTER(?property = <PROPERTY_URI>)\n",
    "        }\n",
    "        ORDER BY ?object\n",
    "    \"\"\",\n",
    "\n",
    "    \"subjects_with_type\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?subject\n",
    "        WHERE {\n",
    "            ?subject rdf:type <TYPE_URI> .\n",
    "        }\n",
    "        ORDER BY ?subject\n",
    "    \"\"\",\n",
    "\n",
    "    \"objects_with_type\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?object\n",
    "        WHERE {\n",
    "            ?s ?p ?object .\n",
    "            ?object rdf:type <TYPE_URI> .\n",
    "        }\n",
    "        ORDER BY ?object\n",
    "    \"\"\",\n",
    "\n",
    "    \"subjects_with_property_value\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?subject\n",
    "        WHERE {\n",
    "            ?subject ?property <VALUE_URI> .\n",
    "            FILTER(?property = <PROPERTY_URI>)\n",
    "        }\n",
    "        ORDER BY ?subject\n",
    "    \"\"\",\n",
    "\n",
    "    \"objects_with_property_value\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?object\n",
    "        WHERE {\n",
    "            ?s ?property ?object .\n",
    "            FILTER(?property = <PROPERTY_URI> && ?object = <VALUE_URI>)\n",
    "        }\n",
    "        ORDER BY ?object\n",
    "    \"\"\",\n",
    "\n",
    "    \"subjects_with_type_and_property\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?subject\n",
    "        WHERE {\n",
    "            ?subject rdf:type <TYPE_URI> ;\n",
    "                     ?property ?o .\n",
    "            FILTER(?property = <PROPERTY_URI>)\n",
    "        }\n",
    "        ORDER BY ?subject\n",
    "    \"\"\",\n",
    "\n",
    "    \"objects_with_type_and_property\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?object\n",
    "        WHERE {\n",
    "            ?s ?property ?object .\n",
    "            ?object rdf:type <TYPE_URI> .\n",
    "            FILTER(?property = <PROPERTY_URI>)\n",
    "        }\n",
    "        ORDER BY ?object\n",
    "    \"\"\",\n",
    "\n",
    "    \"subjects_with_type_and_property_value\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?subject\n",
    "        WHERE {\n",
    "            ?subject rdf:type <TYPE_URI> ;\n",
    "                     ?property <VALUE_URI> .\n",
    "            FILTER(?property = <PROPERTY_URI>)\n",
    "        }\n",
    "        ORDER BY ?subject\n",
    "    \"\"\",\n",
    "\n",
    "    \"objects_with_type_and_property_value\": \"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        SELECT DISTINCT ?object\n",
    "        WHERE {\n",
    "            ?s ?property ?object .\n",
    "            ?object rdf:type <TYPE_URI> .\n",
    "            FILTER(?property = <PROPERTY_URI> && ?object = <VALUE_URI>)\n",
    "        }\n",
    "        ORDER BY ?object\n",
    "    \"\"\"\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql.setQuery(queries[\"count_compositions_composer_name_decade\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "try:\n",
    "    ret = sparql.queryAndConvert()\n",
    "except Exception as e:\n",
    "    print(e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_8323/1270602785.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  df = df.applymap(lambda x: x['value'])\n"
     ]
    }
   ],
   "source": [
    "df = pd.DataFrame(ret[\"results\"][\"bindings\"])\n",
    "# for each entry, conver entry dict into dict['value']\n",
    "df = df.applymap(lambda x: x['value'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>decade</th>\n",
       "      <th>composer</th>\n",
       "      <th>composerName</th>\n",
       "      <th>numberOfCompositions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2000</td>\n",
       "      <td>https://rism.online/people/30004985</td>\n",
       "      <td>Anonymus</td>\n",
       "      <td>108916</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2000</td>\n",
       "      <td>http://d-nb.info/gnd/118818686</td>\n",
       "      <td>Palestrina, Giovanni Pierluigi da (1525-1594)</td>\n",
       "      <td>4440</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2000</td>\n",
       "      <td>http://d-nb.info/gnd/118544489</td>\n",
       "      <td>Händel, Georg Friedrich (1685-1759)</td>\n",
       "      <td>3552</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2000</td>\n",
       "      <td>http://d-nb.info/gnd/118547356</td>\n",
       "      <td>Haydn, Joseph (1732-1809)</td>\n",
       "      <td>3485</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2000</td>\n",
       "      <td>http://d-nb.info/gnd/118584596</td>\n",
       "      <td>Mozart, Wolfgang Amadeus (1756-1791)</td>\n",
       "      <td>2758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9995</th>\n",
       "      <td>2000</td>\n",
       "      <td>https://rism.online/people/30004006</td>\n",
       "      <td>Hartl</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9996</th>\n",
       "      <td>2000</td>\n",
       "      <td>https://rism.online/people/30017546</td>\n",
       "      <td>Wenckel, A. H.</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9997</th>\n",
       "      <td>2000</td>\n",
       "      <td>https://rism.online/people/30022043</td>\n",
       "      <td>Huber, Anton</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9998</th>\n",
       "      <td>2000</td>\n",
       "      <td>https://rism.online/people/30008646</td>\n",
       "      <td>Rocca, Carlo Giorgio (19.sc)</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9999</th>\n",
       "      <td>2000</td>\n",
       "      <td>https://rism.online/people/30073339</td>\n",
       "      <td>Placet, A.</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>10000 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     decade                             composer  \\\n",
       "0      2000  https://rism.online/people/30004985   \n",
       "1      2000       http://d-nb.info/gnd/118818686   \n",
       "2      2000       http://d-nb.info/gnd/118544489   \n",
       "3      2000       http://d-nb.info/gnd/118547356   \n",
       "4      2000       http://d-nb.info/gnd/118584596   \n",
       "...     ...                                  ...   \n",
       "9995   2000  https://rism.online/people/30004006   \n",
       "9996   2000  https://rism.online/people/30017546   \n",
       "9997   2000  https://rism.online/people/30022043   \n",
       "9998   2000  https://rism.online/people/30008646   \n",
       "9999   2000  https://rism.online/people/30073339   \n",
       "\n",
       "                                       composerName numberOfCompositions  \n",
       "0                                          Anonymus               108916  \n",
       "1     Palestrina, Giovanni Pierluigi da (1525-1594)                 4440  \n",
       "2               Händel, Georg Friedrich (1685-1759)                 3552  \n",
       "3                         Haydn, Joseph (1732-1809)                 3485  \n",
       "4              Mozart, Wolfgang Amadeus (1756-1791)                 2758  \n",
       "...                                             ...                  ...  \n",
       "9995                                          Hartl                    1  \n",
       "9996                                 Wenckel, A. H.                    1  \n",
       "9997                                   Huber, Anton                    1  \n",
       "9998                   Rocca, Carlo Giorgio (19.sc)                    1  \n",
       "9999                                     Placet, A.                    1  \n",
       "\n",
       "[10000 rows x 4 columns]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyError",
     "evalue": "'sub'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyError\u001b[0m                                  Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[21], line 2\u001b[0m\n\u001b[1;32m      1\u001b[0m bindings \u001b[38;5;241m=\u001b[39m ret[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mresults\u001b[39m\u001b[38;5;124m\"\u001b[39m][\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mbindings\u001b[39m\u001b[38;5;124m\"\u001b[39m]\n\u001b[0;32m----> 2\u001b[0m rows \u001b[38;5;241m=\u001b[39m [{\u001b[38;5;124m'\u001b[39m\u001b[38;5;124msub\u001b[39m\u001b[38;5;124m'\u001b[39m: \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m<\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mb[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124msub\u001b[39m\u001b[38;5;124m'\u001b[39m][\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mvalue\u001b[39m\u001b[38;5;124m'\u001b[39m]\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m>\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m      3\u001b[0m          \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mpred\u001b[39m\u001b[38;5;124m'\u001b[39m: \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mrdf:type\u001b[39m\u001b[38;5;124m'\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mrdf-syntax-ns#type\u001b[39m\u001b[38;5;124m'\u001b[39m \u001b[38;5;129;01min\u001b[39;00m b[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mpred\u001b[39m\u001b[38;5;124m'\u001b[39m][\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mvalue\u001b[39m\u001b[38;5;124m'\u001b[39m] \u001b[38;5;28;01melse\u001b[39;00m b[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mpred\u001b[39m\u001b[38;5;124m'\u001b[39m][\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mvalue\u001b[39m\u001b[38;5;124m'\u001b[39m],\n\u001b[1;32m      4\u001b[0m          \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mobj\u001b[39m\u001b[38;5;124m'\u001b[39m: \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m<\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mb[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mobj\u001b[39m\u001b[38;5;124m'\u001b[39m][\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mvalue\u001b[39m\u001b[38;5;124m'\u001b[39m]\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m>\u001b[39m\u001b[38;5;124m\"\u001b[39m}\n\u001b[1;32m      5\u001b[0m         \u001b[38;5;28;01mfor\u001b[39;00m b \u001b[38;5;129;01min\u001b[39;00m bindings]\n\u001b[1;32m      6\u001b[0m df \u001b[38;5;241m=\u001b[39m pd\u001b[38;5;241m.\u001b[39mDataFrame(rows)\n",
      "\u001b[0;31mKeyError\u001b[0m: 'sub'"
     ]
    }
   ],
   "source": [
    "bindings = ret[\"results\"][\"bindings\"]\n",
    "rows = [{'sub': f\"<{b['sub']['value']}>\",\n",
    "         'pred': 'rdf:type' if 'rdf-syntax-ns#type' in b['pred']['value'] else b['pred']['value'],\n",
    "         'obj': f\"<{b['obj']['value']}>\"}\n",
    "        for b in bindings]\n",
    "df = pd.DataFrame(rows)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sub</th>\n",
       "      <th>pred</th>\n",
       "      <th>obj</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Def...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Def...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>&lt;http://www.openlinksw.com/virtrdf-data-format...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>&lt;http://www.openlinksw.com/virtrdf-data-format...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>&lt;http://www.openlinksw.com/virtrdf-data-format...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>&lt;http://www.openlinksw.com/virtrdf-data-format...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>&lt;http://www.openlinksw.com/virtrdf-data-format...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>&lt;http://www.openlinksw.com/virtrdf-data-format...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>&lt;http://www.openlinksw.com/virtrdf-data-format...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>&lt;http://www.openlinksw.com/virtrdf-data-format...</td>\n",
       "      <td>rdf:type</td>\n",
       "      <td>&lt;http://www.openlinksw.com/schemas/virtrdf#Qua...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 sub      pred  \\\n",
       "0  <http://www.openlinksw.com/schemas/virtrdf#Def...  rdf:type   \n",
       "1  <http://www.openlinksw.com/schemas/virtrdf#Def...  rdf:type   \n",
       "2  <http://www.openlinksw.com/virtrdf-data-format...  rdf:type   \n",
       "3  <http://www.openlinksw.com/virtrdf-data-format...  rdf:type   \n",
       "4  <http://www.openlinksw.com/virtrdf-data-format...  rdf:type   \n",
       "5  <http://www.openlinksw.com/virtrdf-data-format...  rdf:type   \n",
       "6  <http://www.openlinksw.com/virtrdf-data-format...  rdf:type   \n",
       "7  <http://www.openlinksw.com/virtrdf-data-format...  rdf:type   \n",
       "8  <http://www.openlinksw.com/virtrdf-data-format...  rdf:type   \n",
       "9  <http://www.openlinksw.com/virtrdf-data-format...  rdf:type   \n",
       "\n",
       "                                                 obj  \n",
       "0  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "1  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "2  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "3  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "4  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "5  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "6  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "7  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "8  <http://www.openlinksw.com/schemas/virtrdf#Qua...  \n",
       "9  <http://www.openlinksw.com/schemas/virtrdf#Qua...  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "pise",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "undefined.undefined.undefined"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
